#include <stdlib.h>
#include <time.h>

#define N 50 // розмір масиву з простими числами
int check_prime_num (int a, int check);

int main() {
    srand(time(NULL));
    
    int a = rand() % 100; // початок діапазону простих чисел, що обирається випадково
    int z = rand() % 100 + 100; // кінець діапазону заданих чисел, що теж обираєтсья випадково
    int result[N] = {0}; // задання та очистка масиву
    int check = 1; // коефіцієнт перевірки
    
    for (int x = a, w = 0; x < z; x++) { // запуск циклу для заповнення масиву з простими числами
        check = check_prime_num(x, check);
                if (check == 1) {
                    result [w] = x; // при виконанні умови, що check = 1, відповідному елементу масиву присвоюємо значення а
                    w++; // перехід до наступного елемента масиву
                }
    }
    return 0;
}
int check_prime_num (int x, int check) {
        for (int i = 2, b = 0; i < x; i++) { //запуск циклу для перевірки простого числа
            b = x % i; //запускаємо перевірна на просто число
            if (b == 0) {
                check = -1; // якщо хоча б одно число ділиться націло, то вихід з цикулу та перехід до перевірки наступного числа в заданому діапазоні
                break;
            } else {
                check = 1; // якщо check = 1, то число а є простим
            }
        }
    return check;
}
