#define P 8 //яка буду система числення для заданого числа
int main()
{
	int number = 1245;
	int n1 = number/1000; //вирадення першого числа з 4-розрядного числа
	int n2 = number%1000/100; //вирадення другого числа з 4-розрядного числа
	int n3 = number%1000%100/10; //вирадення третього числа з 4-розрядного числа
	int n4 = number%1000%100%10; //вирадення четвертого числа з 4-розрядного числа
	
	int system10 = P*P*P*n1 + P*P*n2 + P*n3 + n4; //перевод заданого числа в десяткову систему числення
	
	return 0;
}
