/**
 * @mainpage
 * # Загальне завдання
 * 4. **Модернізувати** попередню лабораторну роботу шляхом: додавання класів-спадкоємцев з розділу "Розрахункове завдання /
 Індивідуальні завдання", котрі будуть поширювати функціонал "базового
 класу" відповідно до індивідуального завдання та додавання ще класу-списку для кожного класу-спадкоємцю, що буде
 керувати лише елементами стосовного класу-спадкоємця;
 *
 
 * @date 20-may-2021
 * @version 1.0
 */

/**
 * @file main.cpp
 * @brief Файл з демонстрацією роботи списків List, Basic та їх спадкоємці та методи роботи з ними.
 *
 
 * @date 20-may-2021
 * @version 1.0
 */
#include "list.h"

/**
 * Головна функція.
 *
 * Послідовність дій:
 * -створення данних для класу (@link List_Layer_Birds) та (@link List_Exotic_birds)
 * -створення класу (@link List_Layer_Birds)  та (@link List_Exotic_birds)
 * -робота з методами класу (@link List_Layer_Birds)  та (@link List_Exotic_birds), що мють в собі методи додавання, видалення
 елемента
 * @return успішний код повернення з програми (0)
 */
int main() {
    Basic a;
    Layer_Birds c(a, Липень, Листопад);
    Layer_Birds st("0 Півень 12 12 8 2 1 1 1 2");
    std::string ab;
    st.SetName("CAT!");

    Exotic_birds st2("0 Півень 12 12 8 2 1 1 -10 21");
    st2.SetName("KOT2");
    ab = st2.toString();
    int b;
    std::cin >> b;

    return 0;
}
