/**
 * @mainpage
 * # Загальне завдання
 * 4. **Поширити** попередню лабораторну, а саме використання функцій printf/scanf замінити на використання cout/cin/, усі конкатенації рядків замінити на використання stringstream, замінити метод виводу інформації про об'єкт на метод, що повертає рядок-інформацію про об'єкт, який далі можна виводити на екран, замінити метод вводу інформації про об'єкт на метод, що приймає рядок з інформацією про об'єкт, обробляє його та створює об'єкт на базі цієї інформації, поширити клас-список, шляхом реалізації методів роботи з файлами за допомогою файлових потоків, а саме додати читання та запис з(у) файл;
 *
 * @author Radievych V.
 * @date 20-may-2021
 * @version 1.0
 */

/**
 * @file main.cpp
 * @brief Файл з демонстрацією роботи списків List, Basic та методи роботи з ними.
 *
 * @author Radievych V.
 * @date 20-may-2021
 * @version 1.0
 */
#include "list.h"

/**
 * Головна функція.
 *
 * Послідовність дій:
 * -створення данних для класу (@link List)
 * -створення класу (@link List)
 * -робота з методами класу (@link List), що має в собі методи додавання, видалення
 елемента, отримання елемента по індексу (або ідентифікатору), ввід усіх елементів з файлу та виведення елементів для класу в файл
 * @return успішний код повернення з програми (0)
 */
int main() {
    Feature home(2, 3, 4, Так);
    Feature home1(4, 5, 6, Ні);

    Basic bird(Так, "KOT", 1, home, Чоловіча);
    Basic bird2(Ні, "КОТ2", 3, home1, Жіноча);

    List b(2);
    b.Paste(bird, 0);
    b.Paste(bird2, 1);
    
    std::stringstream ss;
    std::string s1;
    std::string path = "/Users/whatislove/birds.txt";
    std::string path2 = "/Users/whatislove/out_birds.txt";
    
    s1 = bird.toString();
    std::cout << s1 << std::endl;
    
    b.readFromFile(path);
    b.writeToFile(path2);
    return 0;
}
