#define N 3 // розмір матриці в N*N
int main() {
    int matrixA [N][N];
    for (int i = 0; i < N; i++) { // заповнення масиву матриці
            for (int j = 0; j < N; j++) {
                matrixA[i][j] = i * N + j;
            }
        }
    for (int i = 0; i < N; i++) { // перебір ряду матриці
        int temp = matrixA[i][0]; // зберігаємо перші елементи першого столбця матриці, бо при запуску циклів вони будуть втрачені
            for (int b = 0; b < N; b++) { // перебір стовбця матриці
                matrixA [i][b] = matrixA [i][b+1]; // кожному елементу матриці присвоюємо значення наступного елемента матриці
            }
        matrixA[i][N-1] = temp; // переміщаємо перші елементи першого стовбця матриці на останній стовбець матриці
    }
    return 0;
}
